tutorials/bladeMachines/DensityBasedTurbo/AxialMixerMRFCHTSteadyState/constant/solid/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
    ( -1.247470145 5.86888856 0)  //0
    (  1.247470145 5.86888856 0)  //1
    ( -0.51763809020504148  1.9318516525781366 0)  //2
    (  0.51763809020504148  1.9318516525781366 0)  //3

    ( -1.247470145 5.86888856 9)  //4
    (  1.247470145 5.86888856 9)  //5
    ( -0.41582338 1.95629 9)  //6
    (  0.41582338 1.95629 9)  //7

    ( -1.247470145 5.86888856 12)  //8
    (  1.247470145 5.86888856 12)  //9
    ( -0.41582338 1.95629 12)  //10
    (  0.41582338 1.95629 12)  //11

    (0 0 0)  //12
    (0 0 9)  //13

    (-0.20905693 1.98904379 0)  //14
    ( -0.1046719 1.99725907 0)  //15

    (  -0.20905692653530694  5.9963568273967498 0)
    (  -0.10467191248588767  5.9990869130840689 0)  //17

//--------------------------------------------------
    ( -0.20905693 1.98904379 3)  //18
    ( -0.1046719 1.99725907 3)  //19

    (  -0.20905692653530694  5.9963568273967498 3)    //20
    (  -0.10467191248588767  5.9990869130840689 3)   //21

    ( -1.247470145 5.86888856 3)  //22
    (  1.247470145 5.86888856 3)  //23
    ( -0.51763809020504148  1.9318516525781366 3)  //24
    (  0.51763809020504148  1.9318516525781366 3)  //25
//-----------------------------------------------------------------
    ( 0.20905693 1.98904379 6)  //26
    ( 0.1046719 1.99725907 6)  //27
    (  0.20905692653530694  5.9963568273967498 6) //28
    (  0.10467191248588767  5.9990869130840689 6)  //29

//-----------------------------------------------------------------
    ( 0 0 3)  //30
    ( 0 0 6)  //31

    ( 0.20905693 1.98904379 9)  //32
    ( 0.1046719 1.99725907 9)  //33
    (  0.20905692653530694  5.9963568273967498 9)  //34
    (  0.10467191248588767  5.9990869130840689 9)  //35

    ( -1.247470145 5.86888856 9)  //36
    (  1.247470145 5.86888856 9)  //37
    ( -0.51763809020504148  1.9318516525781366 9)  //38
    (  0.51763809020504148  1.9318516525781366 9)  //39


    ( -1.247470145 5.86888856 6)  //40
    (  1.247470145 5.86888856 6)  //41
    ( -0.51763809020504148  1.9318516525781366 6)  //42
    (  0.51763809020504148  1.9318516525781366 6)  //43
//---------------------
    (-0.20705523608201659  0.77274066103125472 3) //44
    (0.20705523608201659  0.77274066103125472 3)  //45

    (-0.20705523608201659  0.77274066103125472 6) //46
    (0.20705523608201659  0.77274066103125472 6)  //47

    (-0.20705523608201659  0.77274066103125472 9) //48
    (0.20705523608201659  0.77274066103125472 9)  //49

    (-0.083622770614122779  0.79561751629461874 0) //50
    (-0.041868764994355073  0.7989036278036592 0)  //51

    (-0.083622770614122779  0.79561751629461874 3) //52
    (-0.041868764994355073  0.7989036278036592 3)  //53

    (0.041868764994355073  0.7989036278036592 6)  //54
    (0.083622770614122779  0.79561751629461874 6) //55

    (0.041868764994355073  0.7989036278036592 9)  //56
    (0.083622770614122779  0.79561751629461874 9) //57

    (-0.20705523608201659  0.77274066103125472 0) //58
    (0.20705523608201659  0.77274066103125472 0)  //59
//-------------------------------------------------------//
);

blocks
(
     hex (18 19 21 20 27 26 28 29) (2 6 6) simpleGrading (1 1 1) //solid blade

     // hub
   //  hex (12 14 2 12 30 18 24 30) (6 2 6) simpleGrading (1 1 1)
   //  hex (12 15 14 12 30 19 18 30) (6 2 6) simpleGrading (1 1 1) //
   //  hex (12 3 15 12 30 25 19 30) (6 2 6) simpleGrading (1 1 1)
   //  hex (30 18 24 30 31 27 42 31) (6 2 6) simpleGrading (1 1 1)
   //  hex (30 19 18 30 31 26 27 31) (6 2 6) simpleGrading (1 1 1) //
   //  hex (30 25 19 30 31 43 26 31) (6 2 6) simpleGrading (1 1 1)
   //  hex (31 27 42 31 13 33 38 13) (6 2 6) simpleGrading (1 1 1)
   //  hex (31 26 27 31 13 32 33 13) (6 2 6) simpleGrading (1 1 1) //
   //  hex (31 43 26 31 13 39 32 13) (6 2 6) simpleGrading (1 1 1)

     hex (58 50 14 2 44 52 18 24) (4 3 6) simpleGrading (1 1 1)
     hex (50 51 15 14 52 53 19 18) (2 3 6) simpleGrading (1 1 1) //
     hex (51 59 3 15 53 45 25 19) (4 3 6) simpleGrading (1 1 1)
     hex (44 52 18 24 46 54 27 42) (4 3 6) simpleGrading (1 1 1)
     hex (52 53 19 18 54 55 26 27) (2 3 6) simpleGrading (1 1 1) //
     hex (53 45 25 19 55 47 43 26) (4 3 6) simpleGrading (1 1 1)
     hex (46 54 27 42 48 56 33 38) (4 3 6) simpleGrading (1 1 1)
     hex (54 55 26 27 56 57 32 33) (2 3 6) simpleGrading (1 1 1) //
     hex (55 47 43 26 57 49 39 32) (4 3 6) simpleGrading (1 1 1)
);

edges
(

//----------------------//
arc 2 14 ( 0.0 2 0) 
arc 14 15 ( 0.0 2 0) 
arc 15 3 ( 0.0 2 0) 

arc 24 18 ( 0.0 2 3) 
arc 18 19 ( 0.0 2 3) 
arc 19 25 ( 0.0 2 3) 

arc 27 42 ( 0.0 2 6) 
arc 26 27 ( 0.0 2 6) 
arc 43 26 ( 0.0 2 6) 

arc 38 33 ( 0.0 2 9) 
arc 32 33 ( 0.0 2 9) 
arc 39 32 ( 0.0 2 9)  
//---------------------------//

arc 58 50 ( 0.0 0.8 0) 
arc 50 51 ( 0.0 0.8 0) 
arc 51 59 ( 0.0 0.8 0) 

arc 44 52 ( 0.0 0.8 3) 
arc 52 53 ( 0.0 0.8 3) 
arc 53 45 ( 0.0 0.8 3) 

arc 46 54 ( 0.0 0.8 6) 
arc 55 54 ( 0.0 0.8 6) 
arc 47 55 ( 0.0 0.8 6) 

arc 48 56 ( 0.0 0.8 9) 
arc 57 56 ( 0.0 0.8 9) 
arc 49 57 ( 0.0 0.8 9)  

);

patches
(
  patch welle_front
   (
      (58 50 14 2)
      (50 51 15 14)
      (51 59 3 15)
    )

   patch welle_back
   (
      (48 56 33 38)
      (56 57 32 33)
      (57 49 39 32)
    )

    patch welle_adiabat
   (
      (58 50 52 44)
      (50 51 53 52)
      (51 59 45 53) 
      (44 52 54 46)
      (52 53 55 54)
      (53 45 47 55)
      (46 54 56 48)
      (54 55 57 56)
      (55 47 49 57)
    ) 

    patch blade_ht
   (
      (18 19 21 20)
      (19 26 28 21)
      (27 26 28 29)
      (18 27 29 20)
      (20 21 28 29)
      (2 14 18 24)
      (14 15 19 18)
      (15 3 25 19)
      (24 18 27 42)
      (19 25 43 26)
      (26 43 39 32)
      (27 26 32 33)
      (42 27 33 38)
    ) 

     patch cyclic_hub1
   (
      (59 45 25 3)
      (45 47 43 25)
      (47 49 39 43)
    ) 
 
    patch cyclic_hub2
   (
      (58 44 24 2)
      (44 46 42 24)
      (46 48 38 42)
    ) 
);

mergePatchPairs
(
);

// ************************************************************************* //
