tutorials/bladeMachines/DensityBasedTurbo/AxialMixerMRFCHTSteadyState/system/solid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    T
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-08;
        relTol          0.1;
    }
}

stressedFoam
{
     nCorrectors     2;
     nNonOrthogonalCorrectors    2;
     U               1e-05;
}
 
// PSIO
// {
//     nCorrectors     2;
//     nNonOrthogonalCorrectors    2;
// //     U               1e-05;
// }

// ************************************************************************* //
